In [1]:
import pandas as pd 
import numpy as np

In [2]:
data= {'a':2,'b':34,'c':55}
ser=pd.Series(data)
ser

a     2
b    34
c    55
dtype: int64

In [3]:
ser=pd.Series(10,index=(0,1,2,3,4,5,6,7,8,9))
ser

0    10
1    10
2    10
3    10
4    10
5    10
6    10
7    10
8    10
9    10
dtype: int64

In [4]:
s=pd.Series([1,2,3,4,5],index=('a','b','c','d','e'))
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
s[0:3]

a    1
b    2
c    3
dtype: int64

In [6]:
s['b']

np.int64(2)

In [7]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [8]:
ls=[[1,23,3],[2,23,5],[34,4,5]]
df=pd.DataFrame(ls)
df

    0   1  2
0   1  23  3
1   2  23  5
2  34   4  5

In [9]:
name='ram','shyam','rohit'
age=23,44,24
dict={'name':name,'age':age}
print(dict)
df=pd.DataFrame(dict)
print(df)

{'name': ('ram', 'shyam', 'rohit'), 'age': (23, 44, 24)}
    name  age
0    ram   23
1  shyam   44
2  rohit   24

In [10]:
name='ram','shyam','rohit'
age=23,44,24
dict={'name':name,'age':age}
indexes=['rank1','rank2','rank3']
print(dict)
df=pd.DataFrame(dict,index=indexes)
print(df)

{'name': ('ram', 'shyam', 'rohit'), 'age': (23, 44, 24)}
        name  age
rank1    ram   23
rank2  shyam   44
rank3  rohit   24

In [11]:
#column selection
df['age']
df['name']

rank1      ram
rank2    shyam
rank3    rohit
Name: name, dtype: object

In [12]:
df.age

rank1    23
rank2    44
rank3    24
Name: age, dtype: int64

In [13]:
city=['mumbai','delhi','chandausi']
df['city']=city
df

        name  age       city
rank1    ram   23     mumbai
rank2  shyam   44      delhi
rank3  rohit   24  chandausi

In [14]:
df.pop('age')
df

        name       city
rank1    ram     mumbai
rank2  shyam      delhi
rank3  rohit  chandausi

In [15]:
#np arrays
random = np.random.randint(low=100, high=500,size=30)
name=np.random.choice(['A','B','C','D','E'],size=30)
age=np.random.choice([12,13,14,18,19,20],size=30)
data={
    'Random':random,
    'Name':name,
    'Age':age
}
df2=pd.DataFrame(data)
df2

    Random Name  Age
0      397    B   12
1      161    C   18
2      176    E   18
3      245    E   12
4      180    C   14
5      443    B   18
6      166    B   18
7      259    C   18
8      145    E   12
9      127    E   19
10     475    C   14
11     300    A   13
12     413    E   14
13     391    E   20
14     259    E   12
15     242    C   19
16     446    D   20
17     386    C   20
18     459    E   14
19     262    E   18
20     116    B   12
21     225    B   18
22     113    B   18
23     310    E   13
24     209    C   20
25     231    B   18
26     296    C   14
27     374    A   20
28     186    A   18
29     381    C   12

In [16]:
df2.shape

(30, 3)

In [17]:
df2.describe()

           Random        Age
count   30.000000  30.000000
mean   279.100000  16.200000
std    112.535772   3.055803
min    113.000000  12.000000
25%    181.500000  13.250000
50%    259.000000  18.000000
75%    384.750000  18.000000
max    475.000000  20.000000

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Random  30 non-null     int32
 1   Name    30 non-null     object
 2   Age     30 non-null     int64
dtypes: int32(1), int64(1), object(1)
memory usage: 732.0+ bytes